{
    "version": "https://jsonfeed.org/version/1",
    "title": "Noten-App Blog",
    "home_page_url": "https://blog.noten-app.de/de/",
    "description": "Noten-App Blog",
    "items": [
        {
            "id": "https://blog.noten-app.de/de/noten-app-eol",
            "content_html": "<p><em>Dieser Blogbeitrag ist auch auf <a href=\"https://blog.noten-app.de/noten-app-eol/\">Englisch</a> verfügbar.</em></p>\n<p>Dieser Blogbeitrag wird in drei Teile unterteilt:</p>\n<ul>\n<li><a href=\"https://blog.noten-app.de/de/noten-app-eol#geschichte\">Die Geschichte der Noten-App</a></li>\n<li><a href=\"https://blog.noten-app.de/de/noten-app-eol#gegenwart\">Was passiert jetzt</a></li>\n<li><a href=\"https://blog.noten-app.de/de/noten-app-eol#zukunft\">Die Zukunft</a></li>\n</ul>\n<p>Fühl dich frei, zu dem Teil zu springen, der dich interessiert.</p>\n<div class=\"theme-admonition theme-admonition-info admonition_xJq3 alert alert--info\"><div class=\"admonitionHeading_Gvgb\"><span class=\"admonitionIcon_Rf37\"><svg viewBox=\"0 0 14 16\"><path fill-rule=\"evenodd\" d=\"M7 2.3c3.14 0 5.7 2.56 5.7 5.7s-2.56 5.7-5.7 5.7A5.71 5.71 0 0 1 1.3 8c0-3.14 2.56-5.7 5.7-5.7zM7 1C3.14 1 0 4.14 0 8s3.14 7 7 7 7-3.14 7-7-3.14-7-7-7zm1 3H6v5h2V4zm0 6H6v2h2v-2z\"></path></svg></span>TL;DR</div><div class=\"admonitionContent_BuS1\"><p>Die Noten-App wird eingestellt.<br>\n<!-- -->Bitte übertrage alle deine Daten bis zum Ende des Jahres in eine andere App.</p></div></div>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"geschichte\">Geschichte der Noten-App<a href=\"https://blog.noten-app.de/de/noten-app-eol#geschichte\" class=\"hash-link\" aria-label=\"Direkter Link zur Geschichte der Noten-App\" title=\"Direkter Link zur Geschichte der Noten-App\">​</a></h2>\n<p>Um diesen Blogbeitrag zu beginnen, möchte ich zuerst ein wenig über die Noten-App und mich selbst erzählen.</p>\n<p>Ich habe die Noten-App im November 2022 gestartet. Es war ein kleines Projekt, das ich begann, um mir mit meinen eigenen Noten zu helfen. Ich war es leid, meine Noten von Hand berechnen zu müssen, und wollte ein einfaches Tool, das das für mich erledigt.<br>\n<!-- -->Zu dieser Zeit war ich noch in der Schule, und da COVID-19 noch ein großes Thema war, hatte ich viel Zeit zur Verfügung. Also begann ich, an der Noten-App zu arbeiten.</p>\n<p>Ich fing mit einer einfachen Homepage für das Projekt an, da ich zu dieser Zeit noch nicht wusste, wie man serverseitig arbeitet und einfach nur ein bisschen Spaß mit HTML und CSS haben wollte. Irgendwie legte ich das Projekt dann beiseite, obwohl es nur eine einfache Homepage ohne jegliche Funktionalität gab.</p>\n<p>Ich begann ein anderes Projekt, Sqowey, über das ich in diesem Blogbeitrag nicht sprechen möchte. Aber es war ein Projekt, an dem ich lange gearbeitet habe und durch das ich lernte, mit Datenbanken und serverseitigem Code zu arbeiten.</p>\n<p>Im März 2023 stieß ich wieder auf die Noten-App und entschied mich, ihr noch eine Chance zu geben. Ich begann wieder daran zu arbeiten und dieses Mal schaffte ich es, eine einfache Version der Noten-App zum Laufen zu bringen. Es war ein simples Tool, mit dem man seine Fächer und Noten eintragen konnte, und es berechnete den Durchschnitt. Alles wurde in einer Datenbank gespeichert, damit man von überall Zugriff hatte, und ich kombinierte das mit einem einfachen Account-System. – Da war sie, die erste funktionale Version der Noten-App war geboren.</p>\n<p>Danach war die Noten-App immer ein On-und-Off-Projekt für mich. Ich arbeitete daran, wenn ich Zeit hatte und wenn ich Lust dazu hatte, was meistens in Zügen auf dem Weg in den Urlaub passierte. Ich hatte nie wirklich einen Plan für die Noten-App, ich wollte einfach nur weiter daran arbeiten und sie verbessern.</p>\n<p>Ich erzählte ein paar Freunden von der Noten-App und sie begannen, sie zu nutzen. Sie gaben mir Feedback, und ich setzte es um. Ich war glücklich, dass ein paar Leute die Noten-App tatsächlich nutzten und dass sie ihnen half. Aber sie war immer noch ziemlich fehlerhaft und nicht besonders benutzerfreundlich, weshalb viele Leute aufhörten, sie zu nutzen. Sie verbreitete sich in meiner Schule und einige Leute von anderen Schulen bekamen auch davon mit, aber sie wurde nie wirklich groß und hörte bei etwa 20 Nutzern auf zu wachsen.<br>\n<!-- -->Dann verging einige Zeit, und ich arbeitete überhaupt nicht mehr an der Noten-App. Ich war mit anderen Projekten und der Schule beschäftigt und hatte keine Zeit dafür. Aber ich hatte sie immer im Hinterkopf und wollte weiter daran arbeiten. Ich begann, diesen Blog zu schreiben, um mich selbst zu motivieren, an der Noten-App zu arbeiten, aber das klappte leider nicht wie geplant.<br>\n<!-- -->Als ich mir jedoch später irgendwann wieder die Statistiken ansah, stellte ich fest, dass die Noten-App ein bisschen weiter gewachsen war und irgendwie Leute sie aktiv nutzten. Ich weiß nicht, wie sie sie gefunden haben, aber ich bin froh, dass sie sie fanden.</p>\n<p>Heute hat die Noten-App 57 Nutzer, und obwohl das nicht viel ist, bin ich trotzdem sehr geehrt, dass einige Leute die Noten-App tatsächlich nutzen.<br>\n<!-- -->Und da wir bereits von heute sprechen, lass uns zum nächsten Teil dieses Blogbeitrags übergehen.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"gegenwart\">Gegenwart<a href=\"https://blog.noten-app.de/de/noten-app-eol#gegenwart\" class=\"hash-link\" aria-label=\"Direkter Link zur Gegenwart\" title=\"Direkter Link zur Gegenwart\">​</a></h2>\n<p>Es tut mir leid, bekanntzugeben, dass die Noten-App eingestellt wird.</p>\n<p>Ich habe lange darüber nachgedacht, und ich bin zu dem Schluss gekommen, dass ich nicht die Zeit und Motivation habe, weiter an der Noten-App zu arbeiten, und es gibt einfach so viele bessere Alternativen.</p>\n<p>Die Noten-App wird am 31. Dezember 2024 eingestellt.</p>\n<p>Bitte übertrage alle deine Daten bis zum Ende des Jahres auf einen anderen Dienst.<br>\n<!-- -->Es tut mir leid für die Unannehmlichkeiten, die dir dadurch entstehen könnten.<br>\n<!-- -->Alle Daten werden nach dem 31. Dezember 2024 gelöscht.</p>\n<p>Falls du nicht weißt, wohin du deine Daten übertragen sollst, empfehle ich dir die App <em>Notan</em>, die im App Store und Google Play Store verfügbar ist.</p>\n<p>Ich möchte allen danken, die die Noten-App genutzt haben. Ich bin wirklich glücklich, dass einige Leute sie genutzt haben und dass sie ihnen geholfen hat.</p>\n<p>Danke!</p>\n<details class=\"details_lb9f alert alert--info details_b_Ee\" data-collapsed=\"true\"><summary>Plan zur Einstellung – mit Zeiten</summary><div><div class=\"collapsibleContent_i85q\"><ol>\n<li>\n<p><strong>17. Oktober 2024</strong> (Heute)<br>\n<!-- -->Ankündigung der Einstellung der Noten-App.<br>\n<!-- -->Die <a href=\"https://github.com/noten-app\" target=\"_blank\" rel=\"noopener noreferrer\">GitHub-Repositories</a> werden mit einem Hinweis auf diesen Blogbeitrag archiviert.</p>\n</li>\n<li>\n<p><strong>Vor dem 31. Dezember 2024</strong><br>\n<!-- -->Ich werde die Statusseite, die API (Programmier-Schnittstelle), die Account-Migrationstools und das Entwickler-Portal der Noten-App abschalten.<br>\n<!-- -->Auch das Beta-Programm und die Analytik (wurde nur für Beta-Tester genutzt) werden deaktiviert.<br>\n<!-- -->Da diese ohnehin kaum genutzt wurden, werde ich sie einfach ausschalten und die Daten löschen.</p>\n</li>\n<li>\n<p><strong>31. Dezember 2024</strong><br>\n<!-- -->Die Noten-App und das Login-System werden abgeschaltet, das Einloggen wird deaktiviert.</p>\n</li>\n<li>\n<p><strong>Nach dem 31. Dezember 2024</strong><br>\n<!-- -->Ich werde nicht sofort alle Daten löschen, sondern sie noch eine Weile aufbewahren, falls jemand seine Daten noch nicht übertragen hat.<br>\n<!-- -->Die Daten werden spätestens am 31. März 2025 gelöscht.</p>\n</li>\n<li>\n<p><strong>Nach dem 31. März 2025</strong><br>\n<!-- -->Der Assets-Server (der Bilder und statischen Code für die App enthält) wird abgeschaltet.<br>\n<!-- -->Was bestehen bleibt, sind der Blog (dieser Blog) und die Dokumentation. Beides wird nicht weiter genutzt, aber da es nur statische Dateien sind, besteht kein Risiko, sie ohne Wartung online zu lassen.</p>\n</li>\n</ol></div></div></details>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"zukunft\">Zukunft<a href=\"https://blog.noten-app.de/de/noten-app-eol#zukunft\" class=\"hash-link\" aria-label=\"Direkter Link zur Zukunft\" title=\"Direkter Link zur Zukunft\">​</a></h2>\n<p>Ich weiß nicht wirklich, was die Zukunft für mich und die Noten-App bereithält.</p>\n<p>Ich werde die Domain (den Namen \"noten-app.de\") behalten, und vielleicht mache ich in Zukunft etwas damit. Aber fürs Erste werde ich sie einfach liegen lassen, und vielleicht komme ich in ein paar Jahren darauf zurück.</p>\n<p>Im Laufe der Jahre habe ich durch die Noten-App viel gelernt, und ich bin dafür sehr dankbar. Ich habe gelernt, wie man mit Datenbanken arbeitet, wie man serverseitigen Code schreibt, wie man Authentifizierungssysteme implementiert und habe mich im HTML, CSS und JavaScript enorm verbessert.<br>\n<!-- -->Ich habe gelernt, wie man mit Bibliotheken wie Chart.js oder FPDF arbeitet, wie man Progressive Web Apps betreibt (die Noten-App war immer nur ein Browserfenster, falls das jemand nicht wusste) und sogar Standard-Dokumente (wie RFC6749) gelesen, und ich bin dafür sehr dankbar.<br>\n<!-- -->Am Ende hatte die Noten-App meiner Meinung nach ein ganz ordentliches Interface. Mein Lieblingsteil waren immer die Einstellungen, weil ich, so seltsam es auch klingt, das Design wirklich mochte und ich denke, sie sind wirklich benutzerfreundlich und sogar etwas angenehmer zu bedienen als die meisten anderen Apps, die ich gesehen habe.</p>\n<p>Jetzt werde ich mich auf andere Projekte konzentrieren und vielleicht sogar eine Karriere einschlagen – wer weiß ;) Wenn du meinen weiteren Weg verfolgen möchtest, kannst du jetzt sogar meinem persönlichen Blog unter <a href=\"https://blog.kondev.de/\" target=\"_blank\" rel=\"noopener noreferrer\">blog.kondev.de</a> folgen.</p>\n<p>Danke, dass du diesen Blogbeitrag gelesen hast, und danke, dass du die Noten-App genutzt hast.</p>",
            "url": "https://blog.noten-app.de/de/noten-app-eol",
            "title": "Das Ende der Noten-App",
            "summary": "Die Noten-App wird eingestellt",
            "date_modified": "2024-10-17T00:00:00.000Z",
            "author": {
                "name": "Konstantin Protzen",
                "url": "https://konstantin-protzen.de"
            },
            "tags": [
                "noten-app"
            ]
        },
        {
            "id": "https://blog.noten-app.de/de/v3_rewriting",
            "content_html": "<p>We are currently working on a new version of the Noten-App which will be Version 3.</p>\n<p>Why we have such a big version jump and what we are planning to do with this version is explained in this blog post.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"rewriting\">Rewriting<a href=\"https://blog.noten-app.de/de/v3_rewriting#rewriting\" class=\"hash-link\" aria-label=\"Direkter Link zur Rewriting\" title=\"Direkter Link zur Rewriting\">​</a></h2>\n<p>The main reason for the big version jump is that we are rewriting the whole app.</p>\n<p>The current app is written really bad and we have a lot of issues with it.<br>\n<!-- -->Also, the app is not really maintainable anymore because of the bad code.</p>\n<p>Also the plans to publish the API so we can finally work on native desktop and mobile-phone apps are delayed because we can't work with the current code.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"what-will-change\">What will change?<a href=\"https://blog.noten-app.de/de/v3_rewriting#what-will-change\" class=\"hash-link\" aria-label=\"Direkter Link zur What will change?\" title=\"Direkter Link zur What will change?\">​</a></h2>\n<p>Even though we are rewriting the whole app, the app will stil look nearly the same. That's because we think the current design is really good and we don't want to completely change it, we just want to make it better.</p>\n<p>As we are rewriting the whole app, we will also fix a lot of bugs. But we realistically don't think that this won't introduce new bugs. ;)</p>\n<p>Our plans to have an eMail-verification for all accounts are still in place and will be implemented with this version.</p>",
            "url": "https://blog.noten-app.de/de/v3_rewriting",
            "title": "Plans for v3",
            "summary": "The update is done",
            "date_modified": "2024-06-01T00:00:00.000Z",
            "author": {
                "name": "Konstantin Protzen",
                "url": "https://konstantin-protzen.de"
            },
            "tags": [
                "noten-app",
                "version",
                "update"
            ]
        },
        {
            "id": "https://blog.noten-app.de/de/v2_4_0-update",
            "content_html": "<p>We have released v2.4.0! 🥳</p>\n<p>This version includes a new year-system which allows you to have multiple years in one account containing all grades, subjects and homework tasks in that year.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"migration\">Migration<a href=\"https://blog.noten-app.de/de/v2_4_0-update#migration\" class=\"hash-link\" aria-label=\"Direkter Link zur Migration\" title=\"Direkter Link zur Migration\">​</a></h2>\n<p>The migration is already done on our servers and we will move all users to the new system till the 31st of December.</p>\n<div class=\"theme-admonition theme-admonition-info admonition_xJq3 alert alert--info\"><div class=\"admonitionHeading_Gvgb\"><span class=\"admonitionIcon_Rf37\"><svg viewBox=\"0 0 14 16\"><path fill-rule=\"evenodd\" d=\"M7 2.3c3.14 0 5.7 2.56 5.7 5.7s-2.56 5.7-5.7 5.7A5.71 5.71 0 0 1 1.3 8c0-3.14 2.56-5.7 5.7-5.7zM7 1C3.14 1 0 4.14 0 8s3.14 7 7 7 7-3.14 7-7-3.14-7-7-7zm1 3H6v5h2V4zm0 6H6v2h2v-2z\"></path></svg></span>Migration Issues</div><div class=\"admonitionContent_BuS1\"><p>Because the migration had some issues some accounts have not already automatically switched to the right year.</p><p>To fix this, please open the settings, click on \"School-Years\" and then click on \"preUpdate\".</p><p>If you want to rename the year just click on \"School-Years\" &gt; \"Manage School-Years\" &gt; Choose the year you want to rename &gt; Change the name &gt; Click on \"Update Year\".</p></div></div>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"e-mails\">E-Mails<a href=\"https://blog.noten-app.de/de/v2_4_0-update#e-mails\" class=\"hash-link\" aria-label=\"Direkter Link zur E-Mails\" title=\"Direkter Link zur E-Mails\">​</a></h3>\n<p>Because new accounts are required to verify their E-Mail-Address we also require all existing accounts to verify their E-Mail-Address.</p>\n<p>When logging in you will be asked to verify your E-Mail-Address.</p>\n<p>You can still use your account without verifying your E-Mail-Address <strong>until around the end of January</strong>, but after that you will not be able to use your account anymore until you verify your E-Mail-Address.</p>",
            "url": "https://blog.noten-app.de/de/v2_4_0-update",
            "title": "Updated to v2.4.0 🎉",
            "summary": "The update is done",
            "date_modified": "2023-12-30T00:00:00.000Z",
            "author": {
                "name": "Konstantin Protzen",
                "url": "https://konstantin-protzen.de"
            },
            "tags": [
                "noten-app",
                "version",
                "update",
                "migration",
                "account",
                "development"
            ]
        },
        {
            "id": "https://blog.noten-app.de/de/v2_4_0-update-upcoming",
            "content_html": "<p>We have finished development of v2.4.0 and will be releasing it soon.</p>\n<p>This version will include a new year-system which will allow you to have multiple years in one account containing all grades, subjects and homework tasks in that year.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"migration\">Migration<a href=\"https://blog.noten-app.de/de/v2_4_0-update-upcoming#migration\" class=\"hash-link\" aria-label=\"Direkter Link zur Migration\" title=\"Direkter Link zur Migration\">​</a></h2>\n<p>Because we added a new year-system all your current grades will be moved to one year with a random name. You can a\nchange that name in the settings.</p>\n<p>We will not (as planned) migrate your account when opening it after the update, but instead we will migrate all accounts at once on our servers.</p>\n<p>This migration is planned to be happening between the 29th and the 31st of December.</p>\n<p>As the migration will take some time you might not be able to access your account during that time.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"e-mails\">E-Mails<a href=\"https://blog.noten-app.de/de/v2_4_0-update-upcoming#e-mails\" class=\"hash-link\" aria-label=\"Direkter Link zur E-Mails\" title=\"Direkter Link zur E-Mails\">​</a></h3>\n<p>Because new accounts are required to verify their E-Mail-Address we will also require all existing accounts to verify their E-Mail-Address.</p>\n<p>When logging in after the update you will be asked to verify your E-Mail-Address.</p>\n<p>You can still use your account without verifying your E-Mail-Address <strong>until around the end of January</strong>, but after that you will not be able to use your account anymore until you verify your E-Mail-Address.</p>",
            "url": "https://blog.noten-app.de/de/v2_4_0-update-upcoming",
            "title": "Upcoming update to v2.4.0",
            "summary": "More about the upcoming version",
            "date_modified": "2023-12-27T00:00:00.000Z",
            "author": {
                "name": "Konstantin Protzen",
                "url": "https://konstantin-protzen.de"
            },
            "tags": [
                "noten-app",
                "version",
                "update",
                "migration",
                "account",
                "development"
            ]
        },
        {
            "id": "https://blog.noten-app.de/de/hello-world",
            "content_html": "<p>Welcome to this blog.<br>\n<!-- -->Here we will post about our progress on the Noten-App and other things you might find interesting.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"upcoming-version-v240\">Upcoming version (v2.4.0)<a href=\"https://blog.noten-app.de/de/hello-world#upcoming-version-v240\" class=\"hash-link\" aria-label=\"Direkter Link zur Upcoming version (v2.4.0)\" title=\"Direkter Link zur Upcoming version (v2.4.0)\">​</a></h2>\n<p>Version 2.4.0 of Noten-App is currently in the end-stages of development and will be released soon.</p>\n<p>This version will include a new year-system which will allow you to have multiple years in one account containing all grades, subjects and homework tasks in that year.</p>\n<p>More Information about the new year-system will be posted in a separate blog post (planned next week).</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"migration\">Migration<a href=\"https://blog.noten-app.de/de/hello-world#migration\" class=\"hash-link\" aria-label=\"Direkter Link zur Migration\" title=\"Direkter Link zur Migration\">​</a></h3>\n<p>Because we added a new year-system all your current grades will be moved to one year with a random name. You can a\nchange that name in the settings.<br>\n<!-- -->The process to update your account to the new version will automatically start when opening it after the update.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"planned-release-date\">Planned release date<a href=\"https://blog.noten-app.de/de/hello-world#planned-release-date\" class=\"hash-link\" aria-label=\"Direkter Link zur Planned release date\" title=\"Direkter Link zur Planned release date\">​</a></h3>\n<p>Currently we plan on releasing v2.4.0 in the Week between the 24th and the 31st of December this Year.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"whats-next\">What's next?<a href=\"https://blog.noten-app.de/de/hello-world#whats-next\" class=\"hash-link\" aria-label=\"Direkter Link zur What's next?\" title=\"Direkter Link zur What's next?\">​</a></h2>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"v300\">v3.0.0<a href=\"https://blog.noten-app.de/de/hello-world#v300\" class=\"hash-link\" aria-label=\"Direkter Link zur v3.0.0\" title=\"Direkter Link zur v3.0.0\">​</a></h3>\n<p>Because the Source-Code of Noten-App is getting more and more complex and hard to maintain we decided to rewrite the app.<br>\n<!-- -->This will also allow us to add new features more easily and faster.</p>\n<p>The Design of the app will nearly stay the same, but we will look into adding some new features and improving old ones.</p>\n<p>We are not able to give an release date yet, but we will keep you updated.</p>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"blog\">Blog<a href=\"https://blog.noten-app.de/de/hello-world#blog\" class=\"hash-link\" aria-label=\"Direkter Link zur Blog\" title=\"Direkter Link zur Blog\">​</a></h3>\n<p>As this is our first blog post we have not yet decided on how often we will post new blog posts.<br>\n<!-- -->Currently we plan on posting a new blog post every 2 - 4 months and when a new version of Noten-App is released.</p>\n<p>Also we are not sure in which languages these will be available.<br>\n<!-- -->Currently we plan on posting them in German and English, but we are not sure if we will be able to do more languages.</p>\n<p>We will keep you updated on this topic.</p>\n<h4 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"feeds\">Feeds<a href=\"https://blog.noten-app.de/de/hello-world#feeds\" class=\"hash-link\" aria-label=\"Direkter Link zur Feeds\" title=\"Direkter Link zur Feeds\">​</a></h4>\n<p>Multiple feeds are available for this blog.<br>\n<!-- -->A feed is a file which contains all blog posts in a specific format a feed-reader-app can read and display.</p>\n<p>If you want to get notified when a new blog post is released you can subscribe to one of these feeds using such a feed-reader-app like feeeed for iOS or Feedly for Android.</p>\n<p>The following feeds are available:</p>\n<table><thead><tr><th>Feed</th><th>URL</th></tr></thead><tbody><tr><td>RSS</td><td><a href=\"https://blog.noten-app.de/rss.xml\" target=\"_blank\" rel=\"noopener noreferrer\">https://blog.noten-app.de/rss.xml</a></td></tr><tr><td>Atom</td><td><a href=\"https://blog.noten-app.de/atom.xml\" target=\"_blank\" rel=\"noopener noreferrer\">https://blog.noten-app.de/atom.xml</a></td></tr><tr><td>JSON</td><td><a href=\"https://blog.noten-app.de/feed.json\" target=\"_blank\" rel=\"noopener noreferrer\">https://blog.noten-app.de/feed.json</a></td></tr></tbody></table>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"newsletters\">Newsletters<a href=\"https://blog.noten-app.de/de/hello-world#newsletters\" class=\"hash-link\" aria-label=\"Direkter Link zur Newsletters\" title=\"Direkter Link zur Newsletters\">​</a></h3>\n<p>We are working on a newsletter system to keep you updated on the progress of Noten-App.<br>\n<!-- -->As we are not able to send out newsletters yet, we will post updates on this blog.</p>\n<p>This newsletter system would allow us to send out newsletters when a new Version of Noten-App is released.<br>\n<!-- -->When it is ready you will be able to subscribe to it in the settings of Noten-App or on our website.</p>\n<h2 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"development\">Development<a href=\"https://blog.noten-app.de/de/hello-world#development\" class=\"hash-link\" aria-label=\"Direkter Link zur Development\" title=\"Direkter Link zur Development\">​</a></h2>\n<h3 class=\"anchor anchorWithStickyNavbar_LWe7\" id=\"apis\">APIs<a href=\"https://blog.noten-app.de/de/hello-world#apis\" class=\"hash-link\" aria-label=\"Direkter Link zur APIs\" title=\"Direkter Link zur APIs\">​</a></h3>\n<p>We already have a few APIs for Noten-App but they are not well documented yet and also have some bugs.<br>\n<!-- -->We plan on fully removing the old APIs and replacing them with new ones.</p>",
            "url": "https://blog.noten-app.de/de/hello-world",
            "title": "Hello World!",
            "summary": "This is our first post",
            "date_modified": "2023-12-14T00:00:00.000Z",
            "author": {
                "name": "Konstantin Protzen",
                "url": "https://konstantin-protzen.de"
            },
            "tags": [
                "hello",
                "welcome",
                "noten-app",
                "post",
                "first"
            ]
        }
    ]
}